СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ИндетификацияАкадемическихЗадолженностей/ИндетификацияАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндетификацияАкадемическихЗадолженностей</name>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристика</name>
    <attributes>
      <name>Дисциплины</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗадолженности</name>
      <type>
        <types>CatalogRef.ПричинаВозникновенияЗадолженостей</types>
      </type>
    </attributes>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУспешныхПересдач</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентУспешныхПересдач</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/AccumulationRegisters/ПросроченныеЗадолженности/ПросроченныеЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПросроченныеЗадолженности</name>
  <resources>
    <name>КоличествоПросроченныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммарноеВремяПросрочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/AccumulationRegisters/НеявкиНаПересдачи/НеявкиНаПересдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеявкиНаПересдачи</name>
  <resources>
    <name>КоличествоНеявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПотерянныеЧасыПреподавателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/InformationRegisters/ТекущийСтатусЗадолженностей/ТекущийСтатусЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущийСтатусЗадолженностей</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоУспешныхПересдач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозникновения</name>
    <type>
      <types>EnumRef.ОписаниеПричины</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ИндетификацияАкадемическихЗадолженностей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПросроченныеЗадолженности Расход
	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристика Из Характеристика Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаХарактеристика.НомерСтроки;
	КонецЦикла;

	// регистр НеявкиНаПересдачи Расход
	Движения.НеявкиНаПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристика Из Характеристика Цикл
		Движение = Движения.НеявкиНаПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Дисциплина = ТекСтрокаХарактеристика.Дисциплины;
		Движение.КоличествоНеявок = ТекСтрокаХарактеристика.НомерСтроки;
	КонецЦикла;

	// регистр ТекущийСтатусЗадолженностей
	Движения.ТекущийСтатусЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристика Из Характеристика Цикл
		Движение = Движения.ТекущийСтатусЗадолженностей.Добавить();
		Движение.Студент = Студент;
		Движение.Дисциплина = ТекСтрокаХарактеристика.Дисциплины;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = ТекСтрокаХарактеристика.НомерСтроки;
		Движение.СтатусЗадолженности = ТекСтрокаХарактеристика.СтатусЗадолженности;
		Движение.ПричинаВозникновения = ТекСтрокаХарактеристика.ПричинаЗадолженности;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
